# Criando SQL via Jupyter Notebook

## Instalando as bibliotecas

In [1]:
pip install sql

Collecting sql
  Downloading sql-2022.4.0.tar.gz (4.2 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Building wheels for collected packages: sql
  Building wheel for sql (setup.py): started
  Building wheel for sql (setup.py): finished with status 'done'
  Created wheel for sql: filename=sql-2022.4.0-py3-none-any.whl size=4335 sha256=f8fa7b8cceb80ca0b5049450972022e2db7f5caa4e076e6e675f49b7539acd12
  Stored in directory: c:\users\alex.souza\appdata\local\pip\cache\wheels\0c\cc\61\62312debc4afba962f05a759a3215104f54cedf22495b4059d
Successfully built sql
Installing collected packages: sql
Successfully installed sql-2022.4.0
Note: you may need to restart the kernel to use updated packages.

In [2]:
pip install ipython-sql

Collecting ipython-sql
  Using cached ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Collecting sqlalchemy>=2.0
  Downloading SQLAlchemy-2.0.19-cp310-cp310-win_amd64.whl (2.0 MB)
     ---------------------------------------- 2.0/2.0 MB 14.0 MB/s eta 0:00:00
Requirement already satisfied: ipython in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from ipython-sql) (8.10.0)
Requirement already satisfied: six in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Collecting sqlparse
  Downloading sqlparse-0.4.4-py3-none-any.whl (41 kB)
     ---------------------------------------- 41.2/41.2 kB ? eta 0:00:00
Collecting prettytable
  Downloading prettytable-3.8.0-py3-none-any.whl (27 kB)
Requirement already satisfied: ipython-genutils in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.4.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.1)
Requirement already satisfied: traitlets>=5 in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.30 in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.36)
Requirement already satisfied: stack-data in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: colorama in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: pickleshare in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: pygments>=2.4.0 in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: jedi>=0.16 in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: matplotlib-inline in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: decorator in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: backcall in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: wcwidth in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: executing in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: pure-eval in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: asttokens in c:\users\alex.souza\appdata\local\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Installing collected packages: sqlparse, sqlalchemy, prettytable, ipython-sql
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.4.39
    Uninstalling SQLAlchemy-1.4.39:
      Successfully uninstalled SQLAlchemy-1.4.39
Successfully installed ipython-sql-0.5.0 prettytable-3.8.0 sqlalchemy-2.0.19 sqlparse-0.4.4
Note: you may need to restart the kernel to use updated packages.

## Carregando a extensão SQL

In [3]:
# Carrega a extensão sql, utilizada para estabelecer a conexão com o banco de dados que iremos criar
%load_ext sql

## Criando ou conectando um banco de dados existente (SQLite)

In [4]:
# Estabelece conexão com o banco de dados (cria o banco de dados caso ele não exista)

%sql sqlite:///zouzadb.db

## Criando tabelas

In [61]:
%%sql

-- Criação da tabela clientes
CREATE TABLE clientes (
    id_cliente INTEGER PRIMARY KEY,
    nome VARCHAR(100),
    email VARCHAR(150),
    telefone VARCHAR(15),
    data_nascimento DATE
);

-- Criação da tabela compras
CREATE TABLE compras (
    id_compra INTEGER PRIMARY KEY,
    id_cliente INTEGER,
    produto VARCHAR(100),
    valor NUMERIC(10, 2),
    data_compra DATE,
    CONSTRAINT FK_id_cli FOREIGN KEY (id_cliente) REFERENCES cliente (id_cliente)
);

 * sqlite:///mydb1.db
Done.
Done.

[]

## Inserindo dados

In [62]:
%%sql
-- Inserção de registros de exemplo na tabela clientes

INSERT INTO clientes (id_cliente, nome, email, telefone, data_nascimento) VALUES
    (1, 'Maria Silva', 'maria@email.com', '(11) 99999-1111', '1990-05-15'),
    (2, 'João Santos', 'joao@email.com', '(21) 98888-2222', '1985-09-20'),
    (3, 'Lídia', 'lid@gmail.com', '(85) 98888-8888','15/08/1995'),
    (4, 'Antonio', 'antonio@gmail.com', '(85) 97777-7777','03/11/1998'),
    (5, 'Alex Souza', 'aasouzaconsult@gmail.com', '(85) 96666-6666','13/09/1985'),
    (6, 'Maria João', 'mariaj@email.com', '(11) 99999-1111', '1990-05-15');

 * sqlite:///mydb1.db
6 rows affected.

[]

In [63]:
%%sql
-- Inserção de registros de exemplo na tabela compras

INSERT INTO compras (id_compra, id_cliente, produto, valor, data_compra) VALUES
    (1, 1, 'Celular', 1500.00, '2023-07-15'),
    (2, 1, 'Notebook', 3500.00, '2023-07-18'),
    (3, 2, 'Mochila', 400.00, '2022-07-20'),
    (4, 2, 'Mouse LG', 100.00, '2022-03-21'),
    (5, 3, 'Pendrive 128Mb', 100.00, '2021-04-23'),
    (6, 2, 'Cadeira Gamer', 1500.00, '2023-05-20'),
    (7, 3, 'Cartucho Mega Drive', 1000.00, '2022-07-21'),
    (8, 4, 'Relógio Barbie', 2000.00, '2023-03-20'),
    (9, 2, 'Mouse Pad', 50.00, '2020-04-02'),
    (10, 5, 'Cabo USB', 300.00, '2021-05-05');

 * sqlite:///mydb1.db
10 rows affected.

[]

## Consultando dados

In [64]:
%%sql

select * from clientes;

 * sqlite:///mydb1.db
Done.

[(1, 'Maria Silva', 'maria@email.com', '(11) 99999-1111', '1990-05-15'),
 (2, 'João Santos', 'joao@email.com', '(21) 98888-2222', '1985-09-20'),
 (3, 'Lídia', 'lid@gmail.com', '(85) 98888-8888', '15/08/1995'),
 (4, 'Antonio', 'antonio@gmail.com', '(85) 97777-7777', '03/11/1998'),
 (5, 'Alex Souza', 'aasouzaconsult@gmail.com', '(85) 96666-6666', '13/09/1985'),
 (6, 'Maria João', 'mariaj@email.com', '(11) 99999-1111', '1990-05-15')]

In [37]:
%%sql

select * from compras;

 * sqlite:///mydb1.db
Done.

[(1, 1, 'Celular', 1500, '2023-07-15'),
 (2, 1, 'Notebook', 3500, '2023-07-18'),
 (3, 2, 'Mochila', 400, '2022-07-20'),
 (4, 2, 'Mouse LG', 100, '2022-03-21'),
 (5, 3, 'Pendrive 128Mb', 100, '2021-04-23'),
 (6, 2, 'Cadeira Gamer', 1500, '2023-05-20'),
 (7, 3, 'Cartucho Mega Drive', 1000, '2022-07-21'),
 (8, 4, 'Relógio Barbie', 2000, '2023-03-20'),
 (9, 2, 'Mouse Pad', 50, '2020-04-02'),
 (10, 5, 'Cabo USB', 300, '2021-05-05')]

In [38]:
%%sql

-- valor total gasto por cliente
SELECT id_cliente
     , sum(valor) as valor_total 
  FROM compras
 GROUP BY id_cliente;

 * sqlite:///mydb1.db
Done.

[(1, 5000), (2, 2050), (3, 1100), (4, 2000), (5, 300)]

In [39]:
%%sql

-- valor total gasto por cliente e por produto
SELECT id_cliente
     , produto
     , sum(valor) as valor_total 
  FROM compras
 GROUP BY id_cliente, produto
 ORDER BY id_cliente ASC;

 * sqlite:///mydb1.db
Done.

[(1, 'Celular', 1500),
 (1, 'Notebook', 3500),
 (2, 'Cadeira Gamer', 1500),
 (2, 'Mochila', 400),
 (2, 'Mouse LG', 100),
 (2, 'Mouse Pad', 50),
 (3, 'Cartucho Mega Drive', 1000),
 (3, 'Pendrive 128Mb', 100),
 (4, 'Relógio Barbie', 2000),
 (5, 'Cabo USB', 300)]

In [41]:
%%sql

-- valor total gasto por cliente (nome) e por produto
SELECT clientes.nome
     , compras.produto
     , sum(compras.valor) as valor_total 
  FROM compras  
  JOIN clientes on clientes.id_cliente = compras.id_cliente
 GROUP BY clientes.nome, compras.produto
 ORDER BY clientes.id_cliente ASC;

 * sqlite:///mydb1.db
Done.

[('Maria Silva', 'Celular', 1500),
 ('Maria Silva', 'Notebook', 3500),
 ('João Santos', 'Cadeira Gamer', 1500),
 ('João Santos', 'Mochila', 400),
 ('João Santos', 'Mouse LG', 100),
 ('João Santos', 'Mouse Pad', 50),
 ('Lídia', 'Cartucho Mega Drive', 1000),
 ('Lídia', 'Pendrive 128Mb', 100),
 ('Antonio', 'Relógio Barbie', 2000),
 ('Alex Souza', 'Cabo USB', 300)]

In [42]:
%%sql

-- valor total gasto por cliente (nome) e por produto (Criar uma Visão)

create view vw_valortotalproduto as
SELECT clientes.nome
     , compras.produto
     , sum(compras.valor) as valor_total 
  FROM compras  
  JOIN clientes on clientes.id_cliente = compras.id_cliente
 GROUP BY clientes.nome, compras.produto
 ORDER BY clientes.id_cliente ASC;

 * sqlite:///mydb1.db
Done.

[]

In [43]:
%%sql

select * from vw_valortotalproduto;

 * sqlite:///mydb1.db
Done.

[('Maria Silva', 'Celular', 1500),
 ('Maria Silva', 'Notebook', 3500),
 ('João Santos', 'Cadeira Gamer', 1500),
 ('João Santos', 'Mochila', 400),
 ('João Santos', 'Mouse LG', 100),
 ('João Santos', 'Mouse Pad', 50),
 ('Lídia', 'Cartucho Mega Drive', 1000),
 ('Lídia', 'Pendrive 128Mb', 100),
 ('Antonio', 'Relógio Barbie', 2000),
 ('Alex Souza', 'Cabo USB', 300)]

In [47]:
%%sql

-- Usando RIGHT JOIN
SELECT cl.nome
     , co.produto
     , sum(co.valor) as valor_total
  FROM compras  co   
  RIGHT JOIN clientes cl on cl.id_cliente = co.id_cliente
 GROUP BY cl.nome, co.produto;

 * sqlite:///mydb1.db
Done.

[('Alex Souza', 'Cabo USB', 300),
 ('Antonio', 'Relógio Barbie', 2000),
 ('João Santos', 'Cadeira Gamer', 1500),
 ('João Santos', 'Mochila', 400),
 ('João Santos', 'Mouse LG', 100),
 ('João Santos', 'Mouse Pad', 50),
 ('Lídia', 'Cartucho Mega Drive', 1000),
 ('Lídia', 'Pendrive 128Mb', 100),
 ('Maria João', None, None),
 ('Maria Silva', 'Celular', 1500),
 ('Maria Silva', 'Notebook', 3500)]

## Apagando o cenário

In [48]:
%%sql

--drop table compras;

 * sqlite:///mydb1.db
Done.

[]

In [49]:
%%sql

--drop table clientes;

 * sqlite:///mydb1.db
Done.

[]

## Integrando com Pandas

In [65]:
# Para carregar os dados da tabela em um pandas data frame
import pandas as pd
import sqlite3

In [66]:
# Estabelece a conexão com o banco de dados
# conn_sqlite = sqlite3.connect("../database/mydb.db")
conn_sqlite = sqlite3.connect("mydb1.db")

In [67]:
# Faz a leitura da tabela:
query = '''
SELECT * FROM clientes
'''
df_cliente = pd.read_sql(sql=query, con=conn_sqlite)

In [69]:
# Visualiza a tabela:

df_cliente.head(6)

,id_cliente,nome,email,telefone,data_nascimento
0,1,Maria Silva,maria@email.com,(11) 99999-1111,1990-05-15
1,2,João Santos,joao@email.com,(21) 98888-2222,1985-09-20
2,3,Lídia,lid@gmail.com,(85) 98888-8888,15/08/1995
3,4,Antonio,antonio@gmail.com,(85) 97777-7777,03/11/1998
4,5,Alex Souza,aasouzaconsult@gmail.com,(85) 96666-6666,13/09/1985
5,6,Maria João,mariaj@email.com,(11) 99999-1111,1990-05-15

In [70]:
# Para inserir dados numa tabela existente:

# Cria um data frame para o exemplo

df_novos_clientes = pd.DataFrame({
    'id_cliente': [7,8],
    'nome': ['Bill Gates', 'S. Jobs'],
    'email': ['bg@gmail.com', 'sj@gmail.com'],
    'telefone': ['(85) 99887-8787', '(85) 99778-8899'],
    'data_nascimento': ['1950-01-05', '1951-02-07']
})

df_novos_clientes.head()

   id_cliente        nome         email         telefone data_nascimento
0           7  Bill Gates  bg@gmail.com  (85) 99887-8787      1950-01-05
1           8     S. Jobs  sj@gmail.com  (85) 99778-8899      1951-02-07

In [71]:
df_novos_clientes.to_sql('clientes', con=conn_sqlite, if_exists='append', index=False)

2

In [74]:
%%sql

SELECT * FROM clientes;

 * sqlite:///mydb1.db
Done.

[(1, 'Maria Silva', 'maria@email.com', '(11) 99999-1111', '1990-05-15'),
 (2, 'João Santos', 'joao@email.com', '(21) 98888-2222', '1985-09-20'),
 (3, 'Lídia', 'lid@gmail.com', '(85) 98888-8888', '15/08/1995'),
 (4, 'Antonio', 'antonio@gmail.com', '(85) 97777-7777', '03/11/1998'),
 (5, 'Alex Souza', 'aasouzaconsult@gmail.com', '(85) 96666-6666', '13/09/1985'),
 (6, 'Maria João', 'mariaj@email.com', '(11) 99999-1111', '1990-05-15'),
 (7, 'Bill Gates', 'bg@gmail.com', '(85) 99887-8787', '1950-01-05'),
 (8, 'S. Jobs', 'sj@gmail.com', '(85) 99778-8899', '1951-02-07')]

In [76]:
# Se o objetivo fosse criar uma nova tabela, por exemplo NOVOS_CLIENTES...

df_novos_clientes.to_sql('new_clientes', con=conn_sqlite, index=False)

2

In [77]:
%%sql

SELECT * FROM new_clientes;

 * sqlite:///mydb1.db
Done.

[(7, 'Bill Gates', 'bg@gmail.com', '(85) 99887-8787', '1950-01-05'),
 (8, 'S. Jobs', 'sj@gmail.com', '(85) 99778-8899', '1951-02-07')]

In [78]:
# É possível substituir uma tabela:

df_novos_clientes.to_sql('clientes', con=conn_sqlite, if_exists='replace', index=False)

2

In [79]:
%%sql

SELECT * FROM clientes;

 * sqlite:///mydb1.db
Done.

[(7, 'Bill Gates', 'bg@gmail.com', '(85) 99887-8787', '1950-01-05'),
 (8, 'S. Jobs', 'sj@gmail.com', '(85) 99778-8899', '1951-02-07')]

## Referências

- https://www.linkedin.com/pulse/como-praticar-sql-jupyter-notebook-ant%2525C3%2525B3nio-c-da-silva-j%2525C3%2525BAnior%3FtrackingId/
- https://ipython.readthedocs.io/en/stable/interactive/magics.html